DSJZS/STM32-projrct/12-1 RW-BPK/User/main.c
#include "stm32f10x.h"                  // Device header
#include "Delay.h"
#include "OLED.h"
#include "Key.h"

uint8_t KeyNum = 0;
uint16_t ArrayWrite[] = { 0x1234, 0x5678};
uint16_t ArrayRead[2];

int main(void)
{
	Key_Init();
	
	OLED_Init();
	OLED_ShowString( 1, 1, "W:");
	OLED_ShowString( 2, 1, "R:");
	
	RCC_APB1PeriphClockCmd( RCC_APB1Periph_PWR, ENABLE);	//	使能PWR的时钟
	RCC_APB1PeriphClockCmd( RCC_APB1Periph_BKP, ENABLE);	//	使能BKP的时钟

	PWR_BackupAccessCmd(ENABLE);	//	设置PWR_CR的DBP，使能对BKP和RTC的访问
	
	while(1)
	{
		KeyNum = Key_GetNum();
		if(KeyNum == 1)
		{
			ArrayWrite[0] ++;
			ArrayWrite[1] ++;
			
			BKP_WriteBackupRegister( BKP_DR1, ArrayWrite[0]);	//	在BKP的DR1写入ArrayWrite[0]
			BKP_WriteBackupRegister( BKP_DR2, ArrayWrite[1]);	//	在BKP的DR2写入ArrayWrite[1]
			
			OLED_ShowHexNum( 1, 3, ArrayWrite[0], 4);
			OLED_ShowHexNum( 1, 8, ArrayWrite[1], 4);
		}
		ArrayRead[0] = BKP_ReadBackupRegister(BKP_DR1);	//	读取BKP的DR1
		ArrayRead[1] = BKP_ReadBackupRegister(BKP_DR2);	//	读取BKP的DR2
		
		OLED_ShowHexNum( 2, 3, ArrayRead[0], 4);
		OLED_ShowHexNum( 2, 8, ArrayRead[1], 4);
	}
}
